# 14. Menggabungkan (merge) dua `DataFrame`

In [1]:
# Import all of the necessary packages
import pandas as pd
import numpy as np

## Persiapan `DataFrame`

In [2]:
n_rows = 5
n_cols = 5
cols = list("ABCDE")

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)
df

    A   B   C   D   E
0  13  17   6  19  13
1  16  10  19  18  14
2  16   1  18   2   2
3  18   1   6  18  14
4  15   3   7  12  11

In [3]:
df1 = df.copy(deep=True)
df1 = df1.drop([1, 4])
df1

    A   B   C   D   E
0  13  17   6  19  13
2  16   1  18   2   2
3  18   1   6  18  14

In [4]:
df2 = df.copy(deep=True)
df2 = df2.drop([0, 3])
df2

    A   B   C   D   E
1  16  10  19  18  14
2  16   1  18   2   2
4  15   3   7  12  11

## Menggabungkan dua `DataFrame`

In [5]:
df_inner = pd.merge(df1, df2, how="inner")
df_inner

    A  B   C  D  E
0  16  1  18  2  2

In [6]:
df_outer = pd.merge(df1, df2, how="outer")
df_outer

    A   B   C   D   E
0  13  17   6  19  13
1  15   3   7  12  11
2  16   1  18   2   2
3  16  10  19  18  14
4  18   1   6  18  14